Sergio5714/wulpus-pro/fw/esp32/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

CONFIG_BSP_LED_PIN=8

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Reserve the fixed USB CDC channel for the WULPUS binary protocol. The XIAO
# pinout uses the default UART0 pins for SPI, so debug builds must explicitly
# select a non-conflicting custom UART console instead.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=20
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=40
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=128
CONFIG_ESP32_WIFI_RX_BA_WIN=32
CONFIG_ESP32_WIFI_TX_BA_WIN=64

CONFIG_LWIP_TCP_SND_BUF_DEFAULT=40000
CONFIG_LWIP_TCP_WND_DEFAULT=40000
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16
CONFIG_WP_GPIO_MSP_TEST=2
CONFIG_WP_GPIO_MSP_TDO=21
CONFIG_WP_GPIO_MSP_TDI=22
CONFIG_WP_GPIO_MSP_TMS=23
CONFIG_WP_GPIO_MSP_TCK=16
